{
  "ERROR.CoreMissing": "Module <strong style='color: orange'>vtta-core</strong> is missing and required for <strong style='color: orange'>VTTA Tokens</strong> to function. Please install and enable it to continue.",
  "ERROR.CoreDisabled": "Module <strong style='color: orange'>vtta-core</strong> is installed, but disabled. You can find it in your module list labeled <strong style='color: orange'>Virtual Tabletop Assets (VTTA)</strong>, please enable it to use VTTA Tokens.",
  "SETTING.defaultNPCFrame.label": "Default border frame image for Non-player characters",
  "SETTING.defaultNPCFrame.hint": "Select an image to be loaded as a default frame",
  "SETTING.defaultPCFrame.label": "Default border frame image for Player characters",
  "SETTING.defaultPCFrame.hint": "Select an image to be loaded as a default frame",
  "SETTING.tokenSize.label": "Size of the generated token",
  "SETTING.tokenSize.hint": "Being quadratic, both width and height are the same value in pixels",
  "SETTING.automaticTokenGeneration.label": "Generate missing tokens automatically",
  "SETTING.automaticTokenGeneration.hint": "Auto-generating a token lacks a token image but has a valid profile image set (with various definitions of success).",
  "BLEND_MODE.SOURCE_OVER.description": "This is the default blend mode and draws new shapes on top of the existing canvas content.",
  "BLEND_MODE.SOURCE_IN.description": "The new shape is drawn only where both the new shape and the destination canvas overlap. Everything else is made transparent.",
  "BLEND_MODE.SOURCE_OUT.description": "The new shape is drawn where it doesn't overlap the existing canvas content.",
  "BLEND_MODE.SOURCE_ATOP.description": "The new shape is only drawn where it overlaps the existing canvas content.",
  "BLEND_MODE.DESTINATION_OVER.description": "New shapes are drawn behind the existing canvas content.",
  "BLEND_MODE.DESTINATION_IN.description": "The existing canvas content is kept where both the new shape and existing canvas content overlap. Everything else is made transparent.",
  "BLEND_MODE.DESTINATION_OUT.description": "The existing content is kept where it doesn't overlap the new shape.",
  "BLEND_MODE.DESTINATION_ATOP.description": "The existing canvas is only kept where it overlaps the new shape. The new shape is drawn behind the canvas content.",
  "BLEND_MODE.LIGHTER.description": "Where both shapes overlap the color is determined by adding color values.",
  "BLEND_MODE.COPY.description": "Only the new shape is shown.",
  "BLEND_MODE.XOR.description": "Shapes are made transparent where both overlap and drawn normal everywhere else.",
  "BLEND_MODE.MULTIPLY.description": "The pixels are of the top layer are multiplied with the corresponding pixel of the bottom layer. A darker picture is the result.",
  "BLEND_MODE.SCREEN.description": "The pixels are inverted, multiplied, and inverted again. A lighter picture is the result (opposite of multiply)",
  "BLEND_MODE.OVERLAY.description": "A combination of multiply and screen. Dark parts on the base layer become darker, and light parts become lighter.",
  "BLEND_MODE.DARKEN.description": "Retains the darkest pixels of both layers.",
  "BLEND_MODE.LIGHTEN.description": "Retains the lightest pixels of both layers.",
  "BLEND_MODE.COLOR_DODGE.description": "Divides the bottom layer by the inverted top layer.",
  "BLEND_MODE.COLOR_BURN.description": "Divides the inverted bottom layer by the top layer, and then inverts the result.",
  "BLEND_MODE.HARD_LIGHT.description": "A combination of multiply and screen like overlay, but with top and bottom layer swapped.",
  "BLEND_MODE.SOFT_LIGHT.description": "A softer version of hard-light. Pure black or white does not result in pure black or white.",
  "BLEND_MODE.DIFFERENCE.description": "Subtracts the bottom layer from the top layer or the other way round to always get a positive value.",
  "BLEND_MODE.EXCLUSION.description": "Like difference, but with lower contrast.",
  "BLEND_MODE.HUE.description": "Preserves the luma and chroma of the bottom layer, while adopting the hue of the top layer.",
  "BLEND_MODE.SATURATION.description": "Preserves the luma and hue of the bottom layer, while adopting the chroma of the top layer.",
  "BLEND_MODE.COLOR.description": "Preserves the luma of the bottom layer, while adopting the hue and chroma of the top layer.",
  "BLEND_MODE.LUMINOSITY.description": "Preserves the hue and chroma of the bottom layer, while adopting the luma of the top layer."
}
